import streamlit as st
# import numpy as np
# import pandas as pd
# from PIL import Image
import time


# ///////////////////////////////////////////////////////////////////////// #
# ///////////////////////////////////////////////////////////////////////// #
# 基本
st.title("Streamlit 超入門")
st.write("DaraFrame")

# ================================================================ #
# 表の追加
# df = pd.DataFrame({
#     "1列目" : [1, 2, 3, 4],
#     "2列目" : [10, 20, 30, 40]
# })

# # st.write(df)

# # 動的なテーブル
# # st.dataframe(df.style.highlight_max(axis = 0), width = 100, height = 100)     # ピクセル単位で縦横を指定できる
# # st.dataframe(df.style.highlight_max(axis = 0))     # ピクセル単位で縦横を指定できる

# # 静的なテーブル
# st.table(df.style.highlight_max(axis = 0))     # ピクセル単位で縦横を指定できる

# # ================================================================ #
# # マジックコマンド
# """
# # 章
# ## 節
# ### 項

# ```python
# import streamlit as st
# import numpy as np
# import pandas as pd
# ```
# """

# # ================================================================ #
# # グラフ作成
# df = pd.DataFrame(
#     np.random.rand(20, 3),
#     columns = ["a", "b", "c"]
# )

# # st.line_chart(df)     # 折れ線グラフ
# # st.area_chart(df)     # エリア
# st.bar_chart(df)       # エリア

# # ================================================================ #
# # マップをプロット
# df = pd.DataFrame(
#     np.random.rand(100, 2) / (50, 50) + [35.69, 139.70],
#     columns = ["lat", "lon"]
# )
# st.map(df)

# # ================================================================ #
# # 画像表示
# img = Image.open("Penguins.jpg")
# st.image(img, caption = "caption = ペンギン", use_column_width = True)


# # ///////////////////////////////////////////////////////////////////////// #
# # ///////////////////////////////////////////////////////////////////////// #
# # インタラクティブ
# # ================================================================ #
# # チェックボックス
# if st.checkbox("Show Image") == True:
#     img = Image.open("Penguins.jpg")
#     st.image(img, caption = "caption = ペンギン", use_column_width = True)

# # ================================================================ #
# # セレクトボックス
# option = st.selectbox("あなたが好きな数字を教えてください", list(range(1, 11)))
# "あなたが好きな数字は、" , option, "です"

# # ================================================================ #
# # テキスト入力
# test = st.text_input("あなたの趣味を教えてください")
# "あなたの趣味:" , test, "です"

# # ================================================================ #
# # スライダー
# condition = st.slider("あなたの今の調子は?", 0, 100, 50)    # 始点, 終点, 初期位置
# "コンデション:" , condition, "です"


# ///////////////////////////////////////////////////////////////////////// #
# ///////////////////////////////////////////////////////////////////////// #
# レイアウトを整える
# # ================================================================ #
# # サイドバー
# st.sidebar.write("Interactive Widgets")
# # **************************************************************** #
# # テキスト入力
# test = st.sidebar.text_input("あなたの趣味を教えてください")
# "あなたの趣味:" , test, "です"

# # **************************************************************** #
# # スライダー
# condition = st.sidebar.slider("あなたの今の調子は?", 0, 100, 50)    # 始点, 終点, 初期位置
# "コンデション:" , condition, "です"

# # ================================================================ #
# # 2カラムレイアウト
# left_column, right_column = st.columns(2)
# # **************************************************************** #
# # 左側のカラム
# button = left_column.button("右カラムに文字を表示")
# if button == True:  # if button:
#     # **************************************************************** #
#     # 右側のカラム
#     right_column.write("ここは右カラムです")

# # ================================================================ #
# # expander
# expander1 = st.expander("問い合わせ_1")
# expander1.write("問い合わせ内容を書く_1-1")
# expander1.write("問い合わせ内容を書く_1-2")
# expander2 = st.expander("問い合わせ_2")
# expander2.write("問い合わせ内容を書く_2-1")
# expander2.write("問い合わせ内容を書く_2-2")

# ///////////////////////////////////////////////////////////////////////// #
# ///////////////////////////////////////////////////////////////////////// #
# プログラスバー
'Start'
latest_iteration = st.empty()
bar = st.progress(0)

for i in range(100):
    latest_iteration.text(f'Iteration {i + 1}')
    bar.progress(i + 1)
    # time.sleep(0.1)

'Done!!!'

# ================================================================ #
# 2カラムレイアウト
left_column, right_column = st.columns(2)
# **************************************************************** #
# 左側のカラム
button = left_column.button("右カラムに文字を表示")
if button == True:  # if button:
    # **************************************************************** #
    # 右側のカラム
    right_column.write("ここは右カラムです")

# ================================================================ #
# expander
expander1 = st.expander("問い合わせ_1")
expander1.write("問い合わせ内容を書く_1-1")
expander1.write("問い合わせ内容を書く_1-2")
expander2 = st.expander("問い合わせ_2")
expander2.write("問い合わせ内容を書く_2-1")
expander2.write("問い合わせ内容を書く_2-2")



